#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_string.resource_code: Refreshing state... [id=y2ba2d96]
azuread_user.AF-4: Refreshing state... [id=5944d766-c250-4e67-97cf-0d02e371822a]
azuread_user.AF-5: Refreshing state... [id=6510e200-ce35-4a2c-8dee-7a4ceebe3b7e]
azuread_user.IT-1: Refreshing state... [id=be22fe10-9d0a-4108-ba9b-5e1e4573e7e3]
azuread_user.IT-2: Refreshing state... [id=d154ea89-8604-4104-9a61-af9256ee9a3c]
azuread_user.IT-3: Refreshing state... [id=1e76a1c0-818a-4ed3-803d-dc0317c23250]
azuread_directory_role.GlobalAdmin: Refreshing state... [id=46131aa8-74dc-45bc-897c-43457932adf3]
azurerm_resource_group.RG_CPE: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC]
data.azurerm_client_config.current: Reading...
azurerm_backup_policy_vm.ProductionVM1-backup-policy: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.RecoveryServices/vaults/ConfidentialRecoveryVault/backupPolicies/ProductionVM1-backup-policy]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04OGI4OWY4Yi1mZmM2LTRkN2EtOGQ2ZS0xZTU5MzM4YzY4NDQ7b2JqZWN0SWQ9ZjFiMmEwYzAtNjMyMS00OThmLWI4NTktNjhiNmY4OWYyMzRiO3N1YnNjcmlwdGlvbklkPTc3YmIwYjA3LTU3ZTUtNDRiNS1hMzUwLTMxMGE5MzkxNzI5ODt0ZW5hbnRJZD1jZTQ3NzVkMy0xYzJlLTQ2NDQtYjJiYy02MzFjMTU3ZDJiZTc=]
azurerm_virtual_network.CondidentialServices-network-1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/CondidentialServices-network-1]
azurerm_virtual_network.System-network-1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/System-network-1]
azurerm_network_security_group.JumpStationSecurityGroup: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/networkSecurityGroups/JumpStationSecurityGroup]
azurerm_public_ip.PublicIP-1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/publicIPAddresses/PublicIP-1]
azurerm_storage_account.ConfidentielStorageAccount: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Storage/storageAccounts/confidentiely2ba2d96]
azurerm_recovery_services_vault.ConfidentialRecoveryVault: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.RecoveryServices/vaults/ConfidentialRecoveryVault]
azurerm_key_vault.KeyVault1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.KeyVault/vaults/KeyVaulty2ba2d96]
azurerm_subnet.System-network-1-subnet-1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/System-network-1/subnets/System-network-1-subnet-1]
azurerm_subnet.System-network-1-subnet-2: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/System-network-1/subnets/System-network-1-subnet-2]
azurerm_virtual_network_peering.ConfidentialServicesToSystem: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/CondidentialServices-network-1/virtualNetworkPeerings/ConfidentialServicesToSystem]
azurerm_subnet.CondidentialServices-network-1-subnet-1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/CondidentialServices-network-1/subnets/CondidentialServices-network-1-subnet-1]
azurerm_network_security_rule.JumpStationSecurityRule-3: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/networkSecurityGroups/JumpStationSecurityGroup/securityRules/Allow_traffic_to_internal_network]
azurerm_virtual_network_peering.SystemToConfidentialServices: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/System-network-1/virtualNetworkPeerings/SystemToConfidentialServices]
azuread_group.AF: Refreshing state... [id=fe9006ad-59e3-4cb7-b33f-43fbc5ce8ca9]
azuread_group.IT: Refreshing state... [id=6ecb85de-9fcf-4c0f-bbd7-19068878bb7b]
azurerm_network_security_rule.JumpStationSecurityRule-2: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/networkSecurityGroups/JumpStationSecurityGroup/securityRules/Allow_only_RDP_traffic_from_CPE_network]
azurerm_network_security_rule.JumpStationSecurityRule-1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/networkSecurityGroups/JumpStationSecurityGroup/securityRules/Allow_traffic_to_internet]
azurerm_network_interface.JumpStationVM1-NIC: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/networkInterfaces/JumpStationVM1-NIC]
azurerm_network_interface.ProductionVM1-NIC: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/networkInterfaces/ProductionVM1-NIC]
azuread_directory_role_assignment.GlobalAdmin: Refreshing state... [id=lAPpYvVpN0KRkAEhdxReEN6Fy27Pnw9Mu9cZBoh4u3s-1]
azuread_conditional_access_policy.AdminAccessPolicy: Refreshing state... [id=e01d78ce-21b6-497a-a243-13924cbb6b70]
azurerm_virtual_machine.ProductionVM1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Compute/virtualMachines/ProductionVM1]
azurerm_virtual_machine.JumpStationVM1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Compute/virtualMachines/JumpStationVM1]
azurerm_storage_share.CondidentialServices-share-1: Refreshing state... [id=https://confidentiely2ba2d96.file.core.windows.net/confidentiel]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azuread_conditional_access_policy.AdminAccessPolicy will be updated in-place
  ~ resource "azuread_conditional_access_policy" "AdminAccessPolicy" {
        id           = "e01d78ce-21b6-497a-a243-13924cbb6b70"
        # (2 unchanged attributes hidden)

      ~ conditions {
            # (4 unchanged attributes hidden)

          ~ applications {
              ~ included_applications = [
                  - "All",
                  + "all",
                ]
                # (2 unchanged attributes hidden)
            }

          ~ locations {
              ~ included_locations = [
                  - "All",
                  + "all",
                ]
                # (1 unchanged attribute hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_backup_policy_vm.Production-backup-policy will be created
  + resource "azurerm_backup_policy_vm" "Production-backup-policy" {
      + id                             = (known after apply)
      + instant_restore_retention_days = (known after apply)
      + name                           = "Production-backup-policy"
      + policy_type                    = "V1"
      + recovery_vault_name            = "ConfidentialRecoveryVault"
      + resource_group_name            = "CPE-POC"
      + timezone                       = "UTC"

      + backup {
          + frequency = "Daily"
          + time      = "23:00"
        }

      + retention_daily {
          + count = 30
        }
    }

  # azurerm_backup_policy_vm.ProductionVM1-backup-policy will be destroyed
  # (because azurerm_backup_policy_vm.ProductionVM1-backup-policy is not in configuration)
  - resource "azurerm_backup_policy_vm" "ProductionVM1-backup-policy" {
      - id                             = "/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.RecoveryServices/vaults/ConfidentialRecoveryVault/backupPolicies/ProductionVM1-backup-policy" -> null
      - instant_restore_retention_days = 2 -> null
      - name                           = "ProductionVM1-backup-policy" -> null
      - policy_type                    = "V1" -> null
      - recovery_vault_name            = "ConfidentialRecoveryVault" -> null
      - resource_group_name            = "CPE-POC" -> null
      - timezone                       = "UTC" -> null

      - backup {
          - frequency     = "Daily" -> null
          - hour_duration = 0 -> null
          - hour_interval = 0 -> null
          - time          = "23:00" -> null
          - weekdays      = [] -> null
        }

      - retention_daily {
          - count = 30 -> null
        }
    }

  # azurerm_backup_protected_vm.ProductionVM1-backup will be created
  + resource "azurerm_backup_protected_vm" "ProductionVM1-backup" {
      + backup_policy_id    = (known after apply)
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "ConfidentialRecoveryVault"
      + resource_group_name = "CPE-POC"
      + source_vm_id        = "/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Compute/virtualMachines/ProductionVM1"
    }

  # azurerm_storage_account.ConfidentielStorageAccount must be replaced
-/+ resource "azurerm_storage_account" "ConfidentielStorageAccount" {
      ~ access_tier                       = "Hot" -> (known after apply)
      ~ account_tier                      = "Standard" -> "Premium" # forces replacement
      ~ id                                = "/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Storage/storageAccounts/confidentiely2ba2d96" -> (known after apply)
      + large_file_share_enabled          = (known after apply)
        name                              = "confidentiely2ba2d96"
      ~ primary_access_key                = (sensitive value)
      ~ primary_blob_connection_string    = (sensitive value)
      ~ primary_blob_endpoint             = "https://confidentiely2ba2d96.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                 = "confidentiely2ba2d96.blob.core.windows.net" -> (known after apply)
      ~ primary_connection_string         = (sensitive value)
      ~ primary_dfs_endpoint              = "https://confidentiely2ba2d96.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                  = "confidentiely2ba2d96.dfs.core.windows.net" -> (known after apply)
      ~ primary_file_endpoint             = "https://confidentiely2ba2d96.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                 = "confidentiely2ba2d96.file.core.windows.net" -> (known after apply)
      ~ primary_location                  = "francecentral" -> (known after apply)
      ~ primary_queue_endpoint            = "https://confidentiely2ba2d96.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                = "confidentiely2ba2d96.queue.core.windows.net" -> (known after apply)
      ~ primary_table_endpoint            = "https://confidentiely2ba2d96.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                = "confidentiely2ba2d96.table.core.windows.net" -> (known after apply)
      ~ primary_web_endpoint              = "https://confidentiely2ba2d96.z28.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                  = "confidentiely2ba2d96.z28.web.core.windows.net" -> (known after apply)
      ~ secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      - tags                              = {} -> null
        # (17 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

Plan: 3 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @AxFrancois, Action: `pull_request`, Workflow: `Terraform Plan`*